# Chicago Taxi Fleet Demo Workbook

In this workbook, we'll explore data relating to Chicago's taxi fleet, trips that the vehicles take, and 311 data about the condition of the roads around the city. As you work through the exercises, you'll learn how to:

* Connect to a CrateDB database cluster in the cloud.

* Create a table and import sample data from a public URL.

* Query and visualize data using SQL pandas dataframes, Plotly and Leaflet maps.  We'll cover:

    * Geospatial queries

    * Timeseries data

    * Aggregrations

    * Joins

## Install Dependencies

First, install the required dependencies by executing the `pip install` command below. Make sure to restart the notebook runtime environment once this command has completed.

**Google Colab Note:** Google Colab currently uses pandas 1.5.3. While installing dependencies, expect to see compatibility errors. You can safely ignore these.

In [ ]:
! pip install -U ipyleaflet ipywidgets sqlalchemy-cratedb pandas plotly nbformat kaleido

## Connect to CrateDB

Before going any further, you'll need to update the code below to include a connection string for your CrateDB cluster. If you prefer, you can set the environment variable `CRATEDB_CONNECTION_STRING` instead.

The code below assumes that you're using a managed [CrateDB Cloud cluster](https://console.cratedb.cloud). If you're running CrateDB locally (for example with Docker), use the "localhost" connection string instead.

In [4]:
import os
import sqlalchemy as sa

# Define database address when using CrateDB Cloud.
# Please find these settings on your cluster overview page.
#
# Replace the placeholders USERNAME, PASSWORD, and HOST with their corresponding values
# Example: crate://admin:my_password@demo.gke1.us-central1.gcp.cratedb.net/?ssl=true
CONNECTION_STRING = os.environ.get(
    "CRATEDB_CONNECTION_STRING",
    "crate://USERNAME:PASSWORD@HOST/?ssl=true",
    # "crate://crate@localhost/",
)

# Connect to CrateDB using SQLAlchemy.
engine = sa.create_engine(
    CONNECTION_STRING, 
    echo=sa.util.asbool(os.environ.get("DEBUG", "false")))
connection = engine.connect()

In [2]:
# Suppress some spurious pandas warnings in the Google Colab environment.
import warnings

warnings.simplefilter("ignore", category=FutureWarning)

## Create Tables

First, let's create tables for our dataset.  CrateDB uses SQL for data definition, manipulation and querying... so we'll use a series of `CREATE TABLE` statements here.

In [5]:
# Community Areas

_ = connection.execute(sa.text(
"""
CREATE TABLE IF NOT EXISTS community_areas (
   areanumber INTEGER PRIMARY KEY,
   name TEXT,
   details OBJECT(DYNAMIC) AS (
       description TEXT INDEX USING fulltext,
       population BIGINT
   ),
   boundaries GEO_SHAPE INDEX USING geohash WITH (PRECISION='1m', DISTANCE_ERROR_PCT=0.025)
);
"""))

# Taxis

_ = connection.execute(sa.text(
"""
CREATE TABLE IF NOT EXISTS taxis (
   vehicleid INTEGER,
   status TEXT,
   make TEXT,
   model TEXT,
   modelyear INTEGER,
   color TEXT,
   fuel TEXT,
   wheelchairaccessible BOOLEAN,
   operator TEXT,
   zipcode TEXT,
   affiliation TEXT,
   medallion TEXT
);"""))

# Taxi Rides

_ = connection.execute(sa.text("""
CREATE TABLE IF NOT EXISTS taxi_rides (
   tripid TEXT,
   vehicleid INTEGER,
   starttime TIMESTAMP,
   endtime TIMESTAMP,
   duration INTEGER,
   miles DOUBLE PRECISION,
   pickupcommunityarea SMALLINT,
   dropoffcommunityarea SMALLINT,
   fare DOUBLE PRECISION,
   tips DOUBLE PRECISION,
   tolls DOUBLE PRECISION,
   extras DOUBLE PRECISION,
   totalcost DOUBLE PRECISION,
   paymenttype TEXT,
   company TEXT,
   pickupcentroidlatitude DOUBLE PRECISION,
   pickupcentroidlongitude DOUBLE PRECISION,
   pickupcentroidlocation GEO_POINT,
   dropoffcentroidlatitude DOUBLE PRECISION,
   dropoffcentroidlongitude DOUBLE PRECISION,
   dropoffcentroidlocation GEO_POINT
);"""))

# 311 Calls

_  = connection.execute(sa.text(
"""
CREATE TABLE IF NOT EXISTS three_eleven_calls (
   srnumber TEXT,
   srtype TEXT,
   srshortcode TEXT,
   createddept TEXT,
   ownerdept TEXT,
   status TEXT,
   origin TEXT,
   createddate TIMESTAMP,
   lastmodifieddate TIMESTAMP,
   closeddate TIMESTAMP,
   week GENERATED ALWAYS AS date_trunc('week', createddate),
   isduplicate BOOLEAN,
   createdhour SMALLINT,
   createddayofweek SMALLINT,
   createdmonth SMALLINT,
   locationdetails OBJECT(DYNAMIC) AS (
       streetaddress TEXT,
       city TEXT,
       state TEXT,
       zipcode TEXT,
       streetnumber TEXT,
       streetdirection TEXT,
       streetname TEXT,
       streettype TEXT,
       communityarea SMALLINT,
       ward SMALLINT,
       policesector SMALLINT,
       policedistrict SMALLINT,
       policebeat SMALLINT,
       precinct SMALLINT,
       latitude DOUBLE PRECISION,
       longitude DOUBLE PRECISION,
       location GEO_POINT
   )
) PARTITIONED BY (week);
"""))

## Load Data

Now, we'll populate those tables with real world open data from the City of Chicago.  We'll use the `COPY FROM` command to load data from a mix of JSONL and CSV files hosted on public URLs.

In [ ]:
# Utility function to display results.

def display_results(table_name, info):
    print(f"{table_name}: loaded {info['success_count']}, errors: {info['error_count']}")

    if info["error_count"] > 0:
        print(f"Errors: {info['errors']}")

# Community Areas

result = connection.execute(sa.text("""
    COPY community_areas 
    FROM 'https://cdn.crate.io/downloads/datasets/cratedb-datasets/academy/chicago-data/chicago_community_areas.json' 
    RETURN SUMMARY;                                  
    """))

display_results("community_areas", result.mappings().first())

# Taxis

result = connection.execute(sa.text("""
    COPY taxis 
    FROM 'https://cdn.crate.io/downloads/datasets/cratedb-datasets/academy/chicago-data/taxi_details.csv' 
    RETURN SUMMARY;
    """))

display_results("taxis", result.mappings().first())

# Taxi Rides

result = connection.execute(sa.text("""
    COPY taxi_rides
    FROM 'https://cdn.crate.io/downloads/datasets/cratedb-datasets/academy/chicago-data/taxi_rides_apr_2024.json.gz'
    WITH (compression='gzip')
    RETURN SUMMARY;
    """))

display_results("taxi_rides", result.mappings().first())

# 311 Calls

result = connection.execute(sa.text("""
    COPY three_eleven_calls 
    FROM 'https://cdn.crate.io/downloads/datasets/cratedb-datasets/academy/chicago-data/311_records_apr_2024.json.gz' 
    WITH (compression='gzip') RETURN SUMMARY;                                   
    """))

display_results("three_eleven_calls", result.mappings().first())

_ = connection.execute(sa.text("REFRESH TABLE community_areas, taxis, taxi_rides, three_eleven_calls"))
_ = connection.execute(sa.text("ANALYZE"))

## Exploring Geospatial Queries and Aggregations

### Visualizing City Data

Chicago is made up of 77 community areas.  The code below fetches the GeoJSON representation of each community area's boundaries from CrateDB, along with its population.  We then add these as layers to a map, coloring them according to the population size.

In [ ]:
import pandas as pd
import random
from ipyleaflet import Map, GeoJSON

center = (41.83068856472101, -87.74024963378908)
map = Map(center=center, zoom=10)

query = """
SELECT name, boundaries, details['population'] as population FROM community_areas
"""
df = pd.read_sql(query, CONNECTION_STRING)

def get_color_for_population(population):
    if population < 20000:
        return "green"
    elif population < 40000:
        return "yellow"
    elif population < 60000:
        return "orange"

    return "red"

for row in df.iterrows():
    community_area = GeoJSON(
        data=row[1]["boundaries"],
        style={
            "stroke": False,
            "fillColor": get_color_for_population(row[1]["population"]),
            "fillOpacity": 0.5
        }
    )

    map.add(community_area)

display(map)

### Analyzing Trip Data

Imagine one of Chicago's taxis took a trip across the city from the downtown area to O'Hare Airport.  How can we query CrateDB in a way that will give us some insights into what's happening with our dataset in the areas that this trip passes through.

First, let's look at the trip on a map...

In [ ]:
trip_map = Map(center=[41.92424883732577, -87.72274017333986], zoom=11)

trip_geometry = {
    "coordinates": [
      [-87.63095706926296, 41.883920956255224],[-87.63093052767819, 41.88325569333841],
      [-87.63684297531508, 41.88322881741743],[-87.63682723619804, 41.88189296484862],
      [-87.64583001093926, 41.88176406531636],[-87.64556244595593, 41.8839084509878],
      [-87.64681360038576, 41.887978891258825],[-87.65712486706367, 41.89568681214507],
      [-87.65859173777416, 41.89703559399271],[-87.66010175174097, 41.90008630499267],
      [-87.6609646168648, 41.902847875583745],[-87.66061947081528, 41.90528823390659],
      [-87.66208634152613, 41.907856931373374],[-87.66786978418733, 41.915623971345894],
      [-87.67311334487873, 41.92011686521596],[-87.68725478998756, 41.927623866972624],
      [-87.69750427145591, 41.93394872585398],[-87.70600433948675, 41.93867612005508],
      [-87.71395364871834, 41.941703526516136],[-87.71855494590349, 41.94634069404421],
      [-87.72523341033431, 41.95064524453744],[-87.74318775119902, 41.960796298357224],
      [-87.75823682581736, 41.96896814729007],[-87.7659547090823, 41.97279282784706],
      [-87.7762448330368, 41.97829052959409],[-87.78428500170016, 41.98283266382293],
      [-87.81256731905091, 41.982340356805935],[-87.82639934099198, 41.98449314861523],
      [-87.85968209819193, 41.9836672569391],[-87.88581982097564, 41.9795526237948],
      [-87.89586899029486, 41.980297647123905]
    ],
  "type": "LineString"
}

trip_line = GeoJSON(
    data={
        "type": "Feature",
        "properties": {},
        "geometry": trip_geometry
    },
    style={
        "color": "#000000"
    })

trip_map.add(trip_line)
display(trip_map)

Now let's see which of Chicago's community areas this trip passes through... we'll determine that by asking CrateDB which community area boundaries intersect with the line representing our trip:

In [7]:
import json

query = f"""
  SELECT name, boundaries 
  FROM community_areas 
  WHERE intersects ('{json.dumps(trip_geometry)}'::object, boundaries)
"""

df = pd.read_sql(query, CONNECTION_STRING)
df

             name                                         boundaries
0  JEFFERSON PARK  {'coordinates': [[[[-87.75263506823083, 41.967...
1    PORTAGE PARK  {'coordinates': [[[[-87.75263506823083, 41.967...
2        AVONDALE  {'coordinates': [[[[-87.6879867878517, 41.9361...
3       WEST TOWN  {'coordinates': [[[[-87.65686079759237, 41.910...
4    NORWOOD PARK  {'coordinates': [[[[-87.78002228630051, 41.997...
5            LOOP  {'coordinates': [[[[-87.6094858028664, 41.8893...
6           OHARE  {'coordinates': [[[[-87.83658087874365, 41.986...
7     IRVING PARK  {'coordinates': [[[[-87.69474577254876, 41.961...
8  NEAR WEST SIDE  {'coordinates': [[[[-87.6375883858287, 41.8862...
9    LOGAN SQUARE  {'coordinates': [[[[-87.68284015972066, 41.932...

Having determined which community areas we'll pass through, we can run a more complex SQL query that joins this data with another query that returns a count of open 311 issues relating to issues with roads.

In [8]:
query=f"""
WITH IntersectingCommunities AS (
    SELECT areanumber, name, boundaries 
    FROM community_areas 
    WHERE intersects ('{json.dumps(trip_geometry)}'::object, boundaries)
)
SELECT name, 
       count(t.srtype) AS open_issues, 
       boundaries 
FROM IntersectingCommunities i, three_eleven_calls t 
WHERE i.areanumber = t.locationdetails['communityarea'] 
      AND t.status = 'Open' 
      AND (srtype LIKE 'Sign Repair%' OR srtype LIKE 'Street Light%' OR srtype LIKE 'Pothole%') 
GROUP BY name, boundaries;
"""

df = pd.read_sql(query, CONNECTION_STRING)
df

,name,open_issues,boundaries
0,NORWOOD PARK,52,"{'coordinates': [[[[-87.78002228630051, 41.997..."
1,LOOP,72,"{'coordinates': [[[[-87.6094858028664, 41.8893..."
2,PORTAGE PARK,200,"{'coordinates': [[[[-87.75263506823083, 41.967..."
3,WEST TOWN,320,"{'coordinates': [[[[-87.65686079759237, 41.910..."
4,IRVING PARK,140,"{'coordinates': [[[[-87.69474577254876, 41.961..."
5,LOGAN SQUARE,390,"{'coordinates': [[[[-87.68284015972066, 41.932..."
6,NEAR WEST SIDE,728,"{'coordinates': [[[[-87.6375883858287, 41.8862..."
7,JEFFERSON PARK,50,"{'coordinates': [[[[-87.75263506823083, 41.967..."
8,OHARE,18,"{'coordinates': [[[[-87.83658087874365, 41.986..."
9,AVONDALE,106,"{'coordinates': [[[[-87.6879867878517, 41.9361..."

Now, we can re-use some of the logic from our original area/population map to show a colour coded guide to where our taxi can expect to find the most issues with the roads along its trip.  Here, red areas have the most issues, then orange and yellow.  Green areas have the fewest.

In [ ]:
def get_color_for_issues(issue_count):
    if issue_count < 50:
        return "green"
    elif issue_count < 150:
        return "yellow"
    elif issue_count < 300:
        return "orange"

    return "red"


trip_with_issues_map = Map(center=[41.92424883732577, -87.72274017333986], zoom=11)

for row in df.iterrows():
    community_area = GeoJSON(
        data=row[1]["boundaries"],
        style={
            "stroke": False,
            "fillColor": get_color_for_issues(row[1]["open_issues"]),
            "fillOpacity": 0.5
        }
    )

    trip_with_issues_map.add(community_area)
    
trip_with_issues_map.add(trip_line)
display(trip_with_issues_map)

### Aggregating Trip Data

As an analytics database, CrateDB excels at aggregate query performance.  Let's look at how the average cost of taxi rides varies by community area, with the highest average first.  As we want to show the community area name in the results, we'll need to perform a join between the `taxi_rides` and `community_areas` tables.

In [10]:
query = """
SELECT 
    t.pickupcommunityarea, 
    c.name, 
    avg(t.totalcost) AS avgcost 
FROM 
    taxi_rides t, community_areas c 
WHERE 
    t.pickupcommunityarea = c.areanumber 
GROUP BY 
    t.pickupcommunityarea, c.name 
ORDER BY avgcost DESC LIMIT 10;
"""

df = pd.read_sql(query, CONNECTION_STRING)
df

   pickupcommunityarea             name    avgcost
0                   76            OHARE  51.607501
1                   56   GARFIELD RIDGE  43.434141
2                   64         CLEARING  37.221961
3                   55        HEGEWISCH  36.081802
4                   52        EAST SIDE  33.390692
5                   53     WEST PULLMAN  32.105275
6                   74  MOUNT GREENWOOD  31.837119
7                   25           AUSTIN  31.154937
8                   54        RIVERDALE  30.864925
9                   75      MORGAN PARK  30.194903

It's simple to plot this data as a bar chart using plotly.

In [ ]:
import plotly.express as px

fig = px.bar(df.head(8), x='name', y='avgcost', title='Average Ride Cost From Community Area')
fig.show()

Let's find out which vehicle took the longest ride using CrateDB's `max_by` function, which returns the value of one column from the row where another column has the highest value for that column.

In [21]:
query = """
SELECT vehicleid, totalcost FROM taxi_rides WHERE tripid = (
    SELECT max_by(tripid, miles) FROM taxi_rides
);
"""

df = pd.read_sql(query, CONNECTION_STRING)
df

   vehicleid  totalcost
0       5413     1579.5
1       5413     1579.5

We often want to generate report style output... here we're using a window function to produce a report that shows each trip a taxi took on a given day, the distance covered by that trip, how that trip ranked by distance compared to other trips that day, and cumulative miles and time driven for the day.

In [22]:
query = """
SELECT 
    row_number() OVER w AS trip_num,
    miles, 
    dense_rank() OVER (ORDER BY miles DESC) AS rank_by_distance, 
    trunc(sum(miles) OVER w, 2) AS cumulative_miles, 
    sum(duration) OVER w AS cumulative_drive_time
FROM 
    taxi_rides
WHERE 
    date_trunc('day', 'America/Chicago', starttime) = 1714366800000 
    AND vehicleid = 5955
WINDOW 
    w AS (ORDER BY starttime ASC)
ORDER BY 
    starttime ASC;
"""

df = pd.read_sql(query, CONNECTION_STRING)
df

    trip_num  miles  rank_by_distance  cumulative_miles  cumulative_drive_time
0          1   1.34                 6              2.68                   1024
1          2   1.34                 6              2.68                   1024
2          3   1.52                 5              5.72                   2298
3          4   1.52                 5              5.72                   2298
4          5   1.65                 4              9.02                   3204
5          6   1.65                 4              9.02                   3204
6          7   1.95                 3             12.92                   4706
7          8   1.95                 3             12.92                   4706
8          9   6.03                 1             24.98                   7350
9         10   6.03                 1             24.98                   7350
10        11   1.28                 7             27.54                   8194
11        12   1.28                 7             27.54                   8194
12        13   0.82                 8             29.18                   8652
13        14   0.82                 8             29.18                   8652
14        15   5.72                 2             40.62                  10330
15        16   5.72                 2             40.62                  10330

There's often a need to downsample time series data, in order to look at it in bigger "buckets" of time.  The following query uses CrateDB's `data_bin` function to show the average distance covered by a taxi ride each day.

In [ ]:
query = """
SELECT
  date_bin('1 day'::INTERVAL, starttime, 0) as ts,
  date_format('%b %e', date_bin('1 day'::INTERVAL, starttime, 0)) AS date,
  avg(miles) as avg_trip_distance
FROM
  taxi_rides
GROUP BY
  ts, date
ORDER BY
  ts DESC
"""

df = pd.read_sql(query, CONNECTION_STRING)

fig = px.bar(df.head(15), x='date', y='avg_trip_distance', title='Average Trip Distance by Day')
fig.show()

We might also want to look at how a particular type of vehicle performs.  This query joins data from the `taxis` and `taxi_rides` tables to return the start time of the most recent ride performed by each Kia Soul vehicle in the taxi fleet.

In [24]:
query = """
SELECT 
    t.vehicleid, make, model, max(r.starttime) AS most_recent_ride_start 
FROM 
    taxis t JOIN taxi_rides r ON t.vehicleid = r.vehicleid 
WHERE 
    make='KIA' AND model='SOUL' 
GROUP BY 
    t.vehicleid, make, model 
ORDER BY 
    most_recent_ride_start DESC;
"""

df = pd.read_sql(query, CONNECTION_STRING)
df

   vehicleid make model  most_recent_ride_start
0       1256  KIA  SOUL           1714537800000
1       3372  KIA  SOUL           1714534200000
2       1166  KIA  SOUL           1714516200000
3       2637  KIA  SOUL           1714499100000
4       3891  KIA  SOUL           1714479300000
5       4458  KIA  SOUL           1714453200000
6       2028  KIA  SOUL           1714451400000
7       5249  KIA  SOUL           1712712600000

And this query returns the number of trips made by each Kia Soul Taxi from O'Hare airport to the downtown Loop Area.  This uses a `LEFT JOIN` to ensure that we also return counts of `0` for vehicles that haven't made any qualifying trips.

In [25]:
query = """
SELECT 
    t.vehicleid, make, model, count(r.vehicleid) AS num_trips 
FROM taxis t LEFT JOIN taxi_rides r ON t.vehicleid = r.vehicleid AND pickupcommunityarea=76 AND dropoffcommunityarea=32 
WHERE 
    t.make='KIA' AND t.model='SOUL' 
GROUP BY 
    t.vehicleid, make, model 
ORDER BY 
    num_trips DESC;
"""

df = pd.read_sql(query, CONNECTION_STRING)
df

   vehicleid make model  num_trips
0       2028  KIA  SOUL         52
1       1166  KIA  SOUL         24
2       4458  KIA  SOUL         20
3       3891  KIA  SOUL          0
4       3372  KIA  SOUL          0
5       5249  KIA  SOUL          0
6       1256  KIA  SOUL          0
7       2637  KIA  SOUL          0

## Continue your Learning Journey

To learn more about CrateDB, sign up for our courses at the CrateDB Academy.  We recommend the [CrateDB Fundamentals](https://cratedb.com/academy/fundamentals/) course for a comprehensive overview, and our [Advanced Time Series](https://cratedb.com/academy/time-series/) course for a deep dive into time series data concepts.